<script setup lang="ts">

</script>

<template>
  <div :class="$style.item">
    Ну типо мой блог. Да, начало. Хз, что тут писать, пока просто пишу, что в голову приходит. И да,
    этот первый пост, даже закомичен будет, потому что до бэкенда далеко, пока только клиент делаю,
    поэтому да. По планам сделать "Мой дневник" - по задумке просто свалка того, что мне интересно
    потыкать. Условно, захотел сделать какой-нибудь клон DnD-kit, тут же его и использовал для
    условного перетаскивания постов. Или ещё что-нибудь. Ещё хотелось бы сюда геймификацию впилить,
    но пока далеко до этого. Интересно, мои мысли кто-нибудь когда-нибудь прочитает ли...
  </div>
</template>

<style module>
.item {
  --component-padding: 12px;
  --component-border-color: #e3e3e3;
  --component-border: 1px solid var(--component-border-color);

  border-bottom: var(--component-border);
  padding: var(--component-padding);
}
</style>
